---
kind: property
id: P:Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs.DialogType
source: html/1b7b2326-764f-b601-799c-13cabe495b37.htm
---
# Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs.DialogType Property

An integer that describes the standard Windows type of the dialog box.

## Syntax (C#)
```csharp
public int DialogType { get; }
```